# a = 100 10-ричная константа
# b = 0b01110101 двочиная константа
# c = 0xzf01ff 16-ричная константа
# d = 10.7587 вещественная 
#s = 'hello' строковая

#действия со строками
# + конкатенация
#* умножение на число

# операции со строками
# & - побитовое И ---- 0 & 0 = 0, 0 & 1 = 0, 0 & 1 = 0, 1 & 1 = 1
# | - побитовое Или
# ^ - XOR
# ~  - побитовое отрицание
# << - побитовый сдвиг влево
# >> - побитовый сдвиг вправо

#как поменять цыет в терминале, вместо букв вводим значение от 1 - 255
# '\u001B[38;2;R;G;Bm'

